Repository: mpsaavedra/oluso
Catalog: src/Email.Abstractions/Resources.*.resx
Languages: es_es

# MsgEmailAddressCouldNotBeNull
source: Email address could not be null, empty or whitespace
es_es: La direccion de correo no puede ser nula, vacia o espacio vacio

# MsgEmailAddressIsInvalid
source: Email address {0} is invalid
es_es: La direccion de correo {email} es invalida

# MsgEmailBodyCoudNotBeNull
source: Email body could not be null, empty or whitespace
es_es: El cuerpo del mensaje no puede ser nullo, vacio o espacio en blanco

# MsgEmailAttachmentCouldNotBeNull
source: Email attachment could not be null
es_es: El adjunto del email no puede ser nullo

# MsgEmailZipDirectoryNotFound
source: Email zip path {0} could not be found
es_es: No se encontrol {filePath} del archivo zip

# MsgEmailTemplateNotFound
source: Email template at {0} not found
es_es: PLantilla del email {filePath} no se encontro

# MsgEmailAttachmentNotFound
source: Email attachment {0} not found
es_es: El adjunto {filePaht} no se ha encontrado

# MsgEmailTemplateDirectoryNotFound
source: Email template directory {0} not found
es_es: Directorio de plantillas de email {templateDir} not found

# MsgDirectoryNotFound
source: Directory {0} not found
es_es: Directorio {directoryPath} no encontrado

# MsgFileNotFound
source: {0} not found
es_es: {filePath} no encontrado

# MsgMustBeOfType
source: {0} must be of type {1}
es_es: {source} debe ser de tipo {type}

# MsgRequiredParameter
source: {0} is required
es_es: {paramname} es requerido

# MsgEmailFromCouldNotBeNull
source: Email from address could not be null
es_es: La direccion del remitente del correo no puede ser nula

# MsgEmailToCouldNotBeNullOrEmpty
source: Email to address could not be null
es_es: La direccion del destinatario no puede ser nula

# MsgEmailZipDirectoryCouldNotBeNull
source: Email zip directory could not be null
es_es: La direccion del zip no puede ser nula

# MsgNullOrEmpty
source: {0} could not be null
es_es: {source} no puede ser nulo

# MsgEmailCouldNotBeSend
source: Email could not be sent
es_es: No se ha podido enviar el correo

# MsgEmailSentSuccessfully
source: Email sent successfully
es_es: Correo enviado con exito

# MsgEmailSendingPleaseWait
source: Sending email, please wait..
es_es: Enviando correo, espere por favor..
