Repository: mpsaavedra/oluso
Catalog: src/Core/Resources.*.resx
Languages: es_es

# MsgItemNullException
source: Item {item} could not be null or empty
es_es: Elemento {item} no puede ser nulo o vacio

# MsgNullOrEmpty
source: {source} could not be null or contain any null item
es_es: {source} no puede ser nulo o contener miembros nulos

# MsgComparisonMustBeTrue
source: Result could not be true
es_es: El resultado no puede ser verdadero

# MsgComparisonMustBeFalse
source: Result could not be false
es_es: El resultado no puede ser falso

# MsgHadFail
source: Operation had fail
es_es: Operacion fallida

# MsgBooleanComparisonFail
source: Invalid boolean result
es_es: Fallo comparacion binaria

# MsgNullOrAnyNull
source: {source} or any of his members could be null
es_es: {source} o cualquiera de sus miembros puede ser nulo

# MsgInvalidFormat
source: {source} is on invalid format
es_es: {source} esta en formato invalido

# MsgNotFound
source: {source} not found
es_es: {source} no ha sido encontrado

# MsgGreater
source: {source} could not be greater than {max}
es_es: {source} no puede ser mayor que {max}

# MsgLower
source: {source} could not be lower than {min}
es_es: {source} no puede ser menor que {min}

# MsgInRange
source: {source} must be in a range between {min} and {max}
es_es: {source} debe estar en un rango entre {min} y {max}
